common/models/CatModel.php

    public static function getAllCats()
    {
        $cat = [0 => '暂无分类'];
        $res = self::find()->asArray()->all();
---
SELECT * FROM `cats`