frontend/models/PostForm.php

DELETE FROM `relation_post_tags` WHERE `post_id`=4
INSERT INTO `relation_post_tags` (`post_id`, `tag_id`) VALUES (4, 3)
---
    public function _eventAddTag($event)
    {
        //保存标签
        $tag = new TagForm();
        $tag->tags = $event->data['tags'];
        $tagids = $tag->saveTags();
        //删除原先的关联关系
        RelationPostTagModel::deleteAll(['post_id' => $event->data['id']]);
        //批量保存文章标签的关联关系
        if (!empty($tagids)) {
            foreach ($tagids as $k => $id) {
                $row[$k]['post_id'] = $this->id;
                $row[$k]['tag_id'] = $id;
            }
            $res = (new Query())->createCommand()
                ->batchInsert(RelationPostTagModel::tableName(), ['post_id', 'tag_id'], $row)
                ->execute();

SELECT * FROM `post_extends` WHERE `post_id`='3'
SELECT * FROM `posts` WHERE `id`='3'
SELECT * FROM `tags` WHERE `id` IN ('1', '2')
---
    public function getViewById($id)
    {
        $res = PostModel::find()->with('relate.tag', 'extend')->where(['id' => $id])->asArray()->one();