frontend/models/PostExtendModel.php

    public function upCounter($cond, $attribute, $num)
    {
        $counter = $this->findOne($cond);
        if (!$counter) {
            $this->setAttributes($cond);
            $this->$attribute = $num;
            $this->save();
        } else {
            $countData[$attribute] = $num;
            $counter->updateCounters($countData);
---
SELECT * FROM `post_extends` WHERE `post_id`='3'
INSERT INTO `post_extends` (`post_id`, `browser`) VALUES (4, 1)
UPDATE `post_extends` SET `browser`=`browser`+1 WHERE `id`=39