frontend/models/TagForm.php

    private function _saveTag($tag)
    {
        $model = new TagModel();
        $res = $model->find()->where(['tag_name' => $tag])->one();
        if (!$res) {
            $model->tag_name = $tag;
            $model->post_num = 1;
            if (!$model->save()) {
---
SELECT EXISTS(SELECT * FROM `tags` WHERE (`tags`.`tag_name`='美文'))
SELECT * FROM `tags` WHERE `tag_name`='美文'
INSERT INTO `tags` (`tag_name`, `post_num`) VALUES ('美文', 1)